{"project" :[
  {
    "id": 1,
    "slug": "promptto-web",
    "title": "Prompt to Web",
    "description": "AI system that converts natural language prompts into fully functional web applications and deploys them automatically.",
    "tags": ["Backend", "AI", "Automation"],
    "github": "https://github.com/swayam5342/TDS1",
    "featured": true,
    "resume_points": [
      "Built an AI-driven system that converts natural-language prompts into fully functional web applications.",
      "Automated GitHub repository creation, commits, and deployment to GitHub Pages.",
      "Implemented retry and resilience workflows for AI and GitHub API failures."
    ],
    "details": {
      "architecture": "FastAPI backend integrated with Google GenAI and GitHub APIs for automated repo creation and deployment pipelines.",
      "challenges": "Handling unreliable LLM outputs and GitHub API failures with retry and validation workflows.",
      "security": "Used API key isolation, secure environment variables, and controlled automation pipelines.",
      "improvements": "Future improvements include multi-template generation and CI/CD pipeline customization."
    }
  },
  {
    "id": 2,
    "slug": "kargo-backend",
    "title": "Kargo Backend",
    "description": "Backend platform enabling containerized app deployments with AI-powered setup and Kubernetes-native scaling.",
    "tags": ["Backend", "Cloud", "Kubernetes","DevOps"],
    "github": "https://github.com/GDGVIT/kargo-backend",
    "featured": true,
    "resume_points": [
      "Implemented multi-provider authentication (Google OAuth, GitHub OAuth, local login).",
      "Integrated GitHub APIs for repository linking and deployment automation.",
      "Built modules for multi-tenant resource allocation and deployment orchestration.",
      "Developed monitoring endpoints and Docker-based build workflows."
    ],
    "details": {
      "architecture": "Containerized microservice-style backend using Docker, Kubernetes, MongoDB, and OAuth2 authentication.",
      "challenges": "Designing multi-tenant deployment orchestration and secure session management.",
      "security": "Implemented OAuth2 authentication flows and secure session handling.",
      "improvements": "Future work includes autoscaling, usage analytics, and advanced monitoring dashboards."
    }
  },
  {
  "id": 3,
  "slug": "windows-soc-lab",
  "title": "Windows SIEM",
  "description": "End-to-end SIEM pipeline that collects Windows telemetry, detects suspicious activity using custom rules, and sends real-time alerts to Telegram and automation workflows.",
  "tags": ["Cybersecurity", "SIEM", "Automation"],
  "github": "https://github.com/swayam5342/win_siem",
  "featured": true,
  "resume_points": [
    "Built a complete SOC pipeline using Sysmon, Winlogbeat, Elasticsearch, Kibana, and ElastAlert2.",
    "Developed detection rules for PowerShell abuse, persistence, process injection, service creation, and suspicious network activity.",
    "Automated deployment using Docker, batch scripts, and environment-based secret management."
    ],
  "details": {
    "architecture": "Windows host runs Sysmon and Winlogbeat to ship logs into a Dockerized Elastic Stack. ElastAlert2 performs rule-based detections and sends alerts to Telegram and n8n workflows.",
    "challenges": "Integrating Windows telemetry with containerized ELK stack and handling Telegram API formatting and environment-variable secret management.",
    "security": "Used environment variables for tokens, separated detection logic from secrets, and implemented automated setup scripts for reproducibility.",
    "improvements": "Planned additions include threat-intelligence enrichment, Grafana dashboards, multi-host monitoring, and TLS-enabled secure deployment."
    }
  }
],
"main_heading": "PROJECTS",
"sub_heading": "RESPOSITORIES AND TECHNICAL LOGS"
}